def area(a,b):
    """
    Вычисляет площадь прямоугольника по данным ширине и высоте.

    Args:
        a (float): ширина прямоугольника.
        b (float): высота прямоугольника.

    Returns:
        float: площадь прямоугольника.

    Example:
        >>> area(10, 5)
        50
    """
    return a*b


def perimeter(a,b):
    """
    Вычисляет периметр прямоугольника по данным ширине и высоте.

    Args:
        a (float): ширина прямоугольника.
        b (float): высота прямоугольника.

    Returns:
        float: периметр прямоугольника.

    Example:
        >>> perimeter(10, 5)
        30
    """
    return (a+b) * 2

