def area(a,h):
    """
    Вычисляет площадь треугольника по данным стороне и высоте.

    Args:
        a (float): сторона треугольника, на которую опущена высота.
        h (float): высота треугольника.

    Returns:
        float: площадь треугольника.

    Example:
        >>> area(10, 5)
        25
    """
    return a*h/2

def perimeter(a,b,c):
    """
    Вычисляет периметр треугольника по данным трём сторонам.

    Args:
        a (float): сторона треугольника.
        b (float): сторона треугольника.
        c (float): сторона треугольника.

    Returns:
        float: периметр треугольника.

    Example:
        >>> perimeter(3, 4, 5)
        12
    """
    return a + b + c


